package 本地测试;

// 给定一个整数数组 nums 和一个目标值 target，请你在该数组中找出 和为目标值 的那 两个整数的下标，并返回它们的下标作为结果。
// 你可以假设每组输入 恰好只有一个解，且 同一个元素不能被重复使用。
// 答案的返回顺序 不限。
//
// 示例 1：
// 输入： nums = [2,7,11,15], target = 9
// 输出： [0,1]
// 解释： 因为 nums[0] + nums[1] == 9，所以返回 [0, 1]。
//
// 示例 2：
// 输入： nums = [3,2,4], target = 6
// 输出： [1,2]
//
// 示例 3：
// 输入： nums = [3,3], target = 6
// 输出： [0,1]
//
// 约束条件
// 	•	2 ≤ nums.length ≤ 10⁴
//         •	-10⁹ ≤ nums[i] ≤ 10⁹
//         •	-10⁹ ≤ target ≤ 10⁹
//         •	题目保证只存在唯一有效答案。
public class test {
    public static void main(String[] args) {

    }

}
